{
	"0": "Undoubtly one of the best games in recent times. This was my first Souls game since it was on PS Plus, and I had heard good things about it. After being stuck on Father Gascoigne for three hours and finally beating him, it became clear how the game was meant to be played. Adjusting to this weird style of playing took time. I have fond memories of long nights wandering around the Forbidden Woods, getting lost in Yahar'gul and finding out about the \"cummfpk\" chalice dungeon. This second half of the game was significantly easier than intended because of that chalice dungeon, but it was a lot more fun now that I didn't need to farm for blood vials constantly. Instead, I could enjoy discovering new enemies, locations and bosses. For a potential remake, all it needs is 60 FPS and a resolution higher than 480p.",
	"7": "I remember getting this game by selling some other PlayStation games to Gamestop. I tried to sell back KH1, but the guy said I should keep it. Compared to KH1 at the time, I did enjoy this a little more. The only real issue was the tutorial being too long and me not knowing who the hell this blonde kid was. The final fight with Xemnas and the sequence leading up to it stand out as one of the best final fights in any game.",
	"108": "Before playing this about two years ago, I did actually play the original on an emulator. I got up to the Keyblade Graveyard as Roxas. The plant enemies kept two-shotting me, so I stoppped playing then. Picking up the game again on console, I did end up playing through all of it. I began the grind for the platinum, but ended up stopping since it would have taken another 50 hours or so since you need all commands, items, etc for all three characters. Compared to other games in the series, it was too much of grind. The base game was alright, but I like the mainline titles better.",
	"205": "I played this without having played the original but knew some basics about the story and characters. The real time combat is great, while still retaining some turn-based elements, mainly that the game almost stops when navigating the command menu. The changes to the story don't bother me at all, it's still good. I'm one trophy away from the platinum, which is infurating since I sunk over 70 hours into it. The one trophy left requires beating the most difficult training simulation on hard mode, which entails beating multiple summons back-to-back and then finally two overpowered robots. I barely managed to play through the game again on hard mode (with a walkthrough). Hell House in particular took several hours. This was mainly due to my resistence to grinding materia. I shouldn't have to grind materia for 12 hours just to not get one-shot by most enemies. It'd be okay if items could be used, but hard mode doesn't let you use items. Perhaps I'll bite the bullet and spend a few days grinding materia one day, if only to get the platinum trophy (two actually, since the PS4 and PS5 versions have seperate lists and saves can be transfered to cheese it). I look forward to the next part of the remake.",
	"300": "I played this on an DS emulator for iOS around 2015 or so. I had no console of my own at the time, and had already played KH1 and KH2 several times on the PS2. This was the only other KH game I was able to play. Writing this now, I don't remember much about the gameplay other than I didn't understand it much. Got around half way through before stopping.",
	"306": "This was played on a 3DS that definitely not rooted. This game was definitely not so big that it couldn't fit on the theoritical SD card and needed to be transfered over LAN. The 3D effect was nice and I did actually keep it on most of the time. About a third of the way through, I stopped caring about the side content and just rushed to the end to finish it.",
	"307": "The trophy for finding all of the recordings of the dead astronauts is apparently bugged, so the platinum is unobtainable. I even played through it again with a walkthrough to re-attempt the trophy and it still didn't work. Aside from that, the concept is alright but the execution is boring.",
	"402": "San Andreas is my first and only GTA game. Although I played it on iOS rather than PS2, it was still fun. Technically did not 100% it since the last seashell I needed was bugged and wouldn't appear where it should. The remaster was obviously a travesty and should be completely disregarded as something that exists.",
	"404": "I really gave this a chance. I started a playthrough on beginner with the thinking that it'd be easy. It's not. Basic attacks should not be consumables. The whole card system is absolutely awful no matter how much I try to understand it. Even with walkthroughs I still can't play it effectively. Days should have been remade, not this GBA trash.",
	"506": "This was one of the first games I played after getting my own PlayStation for the first time. It's great, and the platinum was decent to get. There are issues that need to be tackled in KH4, but overall definitely worthy of a mainline KH game.",
	"509": "Bought this as a joke. I ended up actually enjoying it for the most part, despite the bugs, glitches and barely acceptable performance. So much so that I 100%'d it. After getting a PS5 later on, the performance was better, but still not great. There's a fairly decent game undereath it all.",
	"601": "Every button on the controller does the exact same thing. This is unexcusable. The only reason this isn't a 0 out of 5 is because a few of the levels were somewhat interestingly designed.",
	"609": "I'm not one for rhythm games, but with the KH name attached, I had to give this a chance. I rented a Switch copy from the library and become hooked within a day. Truthfully, I \"tried\" it on PC a few months eariler, but stopped playing after a bit. After enjoying it so much on Switch, I bought it for the PlayStation so I could complete it. I remeber the proud mode songs being impossible at the start, but now most of them are doable. The only complaint I would have is the awkward exclusion of some songs.",
	"702": "I played this freshmen year of college on a crappy laptop since it was free on EGS. Had fun with it and look forward to their new game.",
	"707": "The most common complaint is the heavy reliance on motion controls. I've never had any issues with this, whether standing or sitting down while playing with the Wii remote and nunchuck. Some problems with the original Wii version were solved in the Switch port, like Fi talking too much and item descriptions coming up too often. Larger issues like too many puzzles and lack luster exploration would need a complete remake to tackle.",
	"708": "Depsite the negative reception, I really enjoyed FF15. The music was good, the open world was fun to explore (yes, even with the car!) and the story was decent enough. Combat was good, even if it was really just mash the action button to win. The version on PS Plus is listed as the Royal Edition, however none of the DLC actually loads for whatever reason. This is yet to be fixed or addressed, even after being broken for over a year. This is one of many games that really made the PS4 sound like a jet engine.",
	"709": "Hands down the best metroidvania, and easily in the top 50 games of all time. The best memory I have is spending six hours on and staying up until 5 in the morning to beat Nightmare King Grimm. I did myself dirty and cheesed the first fight only to realize you had to fight a much harder version of him later in the DLC. After that night, I learned to appericate his fight more and even find it kind of fun. If his song wasn't an absolute banger, perhaps I would have just gave up and tried again the next day. The only thing I have left for true completion (112%) is the last pantheon, which is damn near impossible. I tried it again recently and could barely play since it had been so long.",
	"807": "KH1 still holds up even after 21 years. It's a great game all around. The platinum wasn't too bad.",
	"902": "It had been about two years after playing the original that I played the HD version on console. DDD seems to get a lot of negative press, but I did learn to enjoy it alot. The platinum was a little grindy with the whole dream eater thing and requiring most of a second playthrough for some critical mode-only stuff. The command deck takes some getting used it, but I felt it was implemented best here as oppposed to BBS or even 358. Switching between Sora and Riku constantly takes getting used to, but I do hope they implement a similar mechanic in future side titles.",
	"10001": "Replaying this so many years after having played the original was great. I understand who everyone was and most of what was going on in the story. The platinum grind was actually fun, aside from some of the scores needed in the minigames to complete the journal. Drives forms are great and should come back in a future title. No, keyblades transformations in KH3 don't cut it.",
	"10008": "The original Kingdom Hearts, no final mix, remix, or other stupid title. KH is a contender for my favorite series, and this game is probably why. I first played it when I was 11 or so, and remember being stuck on Destiny Island for several hours before figuring out what to do. Someway, somehow, I did eventually beat it. I do remember the final fights with Ansem being extremely difficult and taking a few hours of attempts to do. Combat is simple and clean, so to speak, and the story is straightforward as well. Not a single bad memory.",
	"10101": "I got stuck on a puzzle early on where you need to pull a box down with the Batmobile, but the trick is it blocks the opening you need to go in to progress. I refuse to look up the solution, so I kind of just stopped playing after that. Might go back one day and give it another chance.",
	"10103": "As a tech demo for KH3, this was alright. It's short, sure, but still stands on its own as a game. Playing as Aqua is cool and feels better than BBS. The title, like many KH games, is stupid. One thing I hope comes to future games from this one is the character customization. Even with no functional purpose, it's neat to be able to alter the appearance of your character, even just a little bit.",
	"10106": "Yes, it is mostly just walk from point A to point B and deliver an Amazon package to some dude with a stupid name. Yes, it can be boring at times. However, I found that it was still fun to play. The story was decent and easy enough to follow. The graphics were great and the controls were complicated enough to be more than hold foward. The vehicles were fun, as was building out the road in the second area. Combat felt slow and sluggish, although that was clearly not the focus. I look forward to the sequel in 100 years from now.",
	"10107": "Funny robot dinosaur game is actually alright. The combat did feel satisfying at times, but could just as easily be frustrating. I would usually just spam arrows and very rarily used melee weapons. Didn't care much for the story, but the idea is neat.",
	"10203": "The best praise I can give this game is the near instant fast travel. I timed it and it's actually less than two seconds. Aside from that, the combat was very satisfying, albeit not too challenging once you get the hang of it. It's not overtly complicated, like DMC for example, but complicated enough where you aren't just pressing X or R1 over and over again. The open world was a bit Ubisoft-like with all these icons on the map you had to go to, and quests usually told you exactly where to go. Depsite that, I still enjoyed my 60 hours or so with it, so much so that I bothered to platinum it as well. The DLC was alright, even if it really did boil down to just more of the same.",
	"10206": "I played this after Bloodborne but before playing Dark Souls II. I stopped playing after a few days when I got stuck on Flamelurker. The main issue I have is the healing. Like Bloodborne, it's entirely through consumables rather than estus flasks. Unlike Bloodborne, however, it's a god damn chore to farm them or farm souls to buy them. In Bloodborne, this was not an issue since enemies dropped blood vials often, and the little farming you had to do early game was tolerable. In Demon Souls, I didn't have the will to farm for an hour just to get another try at the boss and be one-shot again. I plan on resuming my playthrough at some point, perhaps using a glitch to get infinite healing items so that I can enjoy the game.",
	"10309": "One of the best games, maybe even as good as Bloodborne in some aspects. The blend of open world and legacy dungeons is amazing, the combat is great, and the boss/enemy variety and music is unparalleled. The only real complaint would be that the endgame areas before Leyndell like the snowy mountain area are lackluster in comparsion to all of the others. The catacombs didn't feel varied enough either. I plan on replaying shortly before the DLC comes out.",
	"10400": "This was my second Souls game, almost a year after playing Bloodborne and shortly before getting Elden Ring. Depsite the generally negative perception, I enjoyed my time with it for the most part. Some of the boss run backs were absolutely awful, and the slower pace was an adjustment having only ever played Bloodborne prior. Late in the mid-game, I was overleveled to the point where most enemies and bosses didn't pose a threat. Similar to how Bloodborne went, this actually made me enjoy the game more. Perhaps I'd feel different if I played to vanilla version way back when, but this was a great time. Didn't bother with the DLC or getting the platinum, since I had just ordered a copy of Elden Ring and wanted to get to that.",
	"10402": "This is one of the best looking third party games on Switch. I'm not into racing games much, but it was fun enough to keep playing for a bit. The 60 FPS was great as well.",
	"10703": "I gave this a chance. I really did. Having heard this was one of the best action games, and the best DMC title, I wanted to give it a shot. Upon starting, the resolution was barely 720p (on the PS5 version!) and the framerate was barely 30. Performance aside, I could not get with the controls at all. There are too many button combinations to remember. I don't need \"press X to win\" simplicity, but this was too far in the other direction. For some people this is probably fun, but I can't get into it.",
	"10800": "Much improved over the first, but definitely felt like more of the same. If this and the first weren't on PS Plus, I would not have bought and played them. Like the original, I enjoyed it enough to 100% it I guess. The Zenith were really cool and are my favorite new addition.",
	"10802": "Other than Paper Mario, I can never get into turn-based comabt. This game was no exception. After having enjoyed the remake, I decided to try the original since it was on PS Plus. It was decent overall, despite not liking the \"combat.\" I did turn on the 3x speed, infinite health and infinite limits cheats because I wanted to just explore the world and experience everything in the game that wasn't a poor excuse for combat. Music was great, although I found some of the cooresponding tracks in the remake to be better. Story was good and the characters were well written. Look forward to playing the next remake and seeing how it compares.",
	"10803": "I gave up after getting stuck on one of the later Seymour fights. I felt like I was fairly leveled, yet he one shot every character. The only way to progress would be to grind the low level enemies just before the fight for days on end, which is not an option for me. Up until that point, I did somewhat enjoy the game, depsite it being turn-based combat. I also briefly tried X-2, but stopped playing after half an hour because I was so burnt from getting stuck in X that I wanted to move on.",
	"20001": "I played this after playing Elden Ring, DS2 and Bloodborne. Specifically in comparsion to Dark Souls II, I like this one better for a few reasons. The combat is a bit faster, the level design flows better, and the bosses are more memorable (as well as their music). The only real complaint I have is that you don't unlock fast travel for awhile, especially when you don't know how to get it. This is somewhat offset by the inter-connected world and abundance of shortcuts, but it still felt bad. My playthrough was tainted since I used the first Firekeeper Soul as an item without realizing what it did and how it was supposed to be used. Instead of starting over, I used the duplication glitch on some soul items to level up enough to make up for the loss in health. Despite this, I was still overleveled by the endgame. Gwyn was tough, and definitely a good fight to finish off the game.",
	"20003": "As one of many Final Fantasy games on PS Plus, I decided this give this a try since it wasn't turn based and it had decent reviews. After a few hours, I stopped playing since the gameplay loop didn't click with me at all. The combat felt awkward to control, and I'm also not a fan of mission structures in games. There were so many different systems that were not explained at all, it was overwhelming to try and understand it all."
}