{
	"0": "Undoubtly one of the best games in recent times. This was my first Souls game since it was on PS Plus, and I had heard good things about it. After being stuck on Father Gascoigne for three hours and finally beating him, it became clear how the game was meant to be played. Adjusting to this weird style of playing took time. I have fond memories of long nights wandering around the Forbidden Woods, getting lost in Yahar'gul and finding out about the \"cummfpk\" chalice dungeon. This second half of the game was significantly easier than intended because of that chalice dungeon, but it was a lot more fun now that I didn't need to farm for blood vials constantly. Instead, I could enjoy discovering new enemies, locations and bosses. For a potential remake, all it needs is 60 FPS and a resolution higher than 480p.",
	"205": "I played this without having played the original but knew some basics about the story and characters. The real time combat is great, while still retaining some turn-based elements, mainly that the game almost stops when navigating the command menu. The changes to the story don't bother me at all, it's still good. I'm one trophy away from the platinum, which is infurating since I sunk over 70 hours into it. The one trophy left requires beating the most difficult training simulation on hard mode, which entails beating multiple summons back-to-back and then finally two overpowered robots. I barely managed to play through the game again on hard mode (with a walkthrough). Hell House in particular took several hours. This was mainly due to my resistence to grinding materia. I shouldn't have to grind materia for 12 hours just to not get one-shot by most enemies. It'd be okay if items could be used, but hard mode doesn't let you use items. Perhaps I'll bite the bullet and spend a few days grinding materia one day, if only to get the platinum trophy (two actually, since the PS4 and PS5 versions have seperate lists and saves can be transfered to cheese it). I look forward to the next part of the remake.",
	"307": "The trophy for finding all of the recordings of the dead astronauts is apparently bugged, so the platinum is unobtainable. I even played through it again with a walkthrough to re-attempt the trophy and it still didn't work. Aside from that, the concept is alright but the execution is boring.",
	"509": "Bought this as a joke. I ended up actually enjoying it for the most part, despite the bugs, glitches and barely acceptable performance. So much so that I 100%'d it. After getting a PS5 later on, the performance was better, but still not great. There's a fairly decent game undereath it all.",
	"601": "Every button on the controller does the exact same thing. This is unexcusable. The only reason this isn't a 0 out of 5 is because a few of the levels were somewhat interestingly designed.",
	"707": "The most common complaint is the heavy reliance on motion controls. I've never had any issues with this, whether standing or sitting down while playing with the Wii remote and nunchuck. Some problems with the original Wii version were solved in the Switch port, like Fi talking too much and item descriptions coming up too often. Larger issues like too many puzzles and lack luster exploration would need a complete remake to tackle.",
	"708": "Depsite the negative reception, I really enjoyed FF15. The music was good, the open world was fun to explore (yes, even with the car!) and the story was decent enough. Combat was good, even if it was really just mash the action button to win. The version on PS Plus is listed as the Royal Edition, however none of the DLC actually loads for whatever reason. This is yet to be fixed or addressed, even after being broken for over a year. This is one of many games that really made the PS4 sound like a jet engine.",
	"10009": "This is a game that is alright to play once, but there's zero incentive to play it again. Having small puzzles and mildly interesting travseral was good, and the platinum trophy was easy to obtain.",
	"10101": "I got stuck on a puzzle early on where you need to pull a box down with the Batmobile, but the trick is it blocks the opening you need to go in to progress. I refuse to look up the solution, so I kind of just stopped playing after that. Might go back one day and give it another chance.",
	"10106": "Yes, it is mostly just walk from point A to point B and deliver an Amazon package to some dude with a stupid name. Yes, it can be boring at times. However, I found that it was still fun to play. The story was decent and easy enough to follow. The graphics were great and the controls were complicated enought to be more than hold foward. The vehicles were fun, as was building out the road in the second area. Combat felt slow and sluggish, although that was clearly not the focus. I look forward to the sequel in 100 years from now.",
	"10206": "I played this after Bloodborne but before playing Dark Souls II. I stopped playing after a few days when I got stuck on Flamelurker. The main issue I have is the healing. Like Bloodborne, it's entirely through consumables rather than estus flasks. Unlike Bloodborne, however, it's a god damn chore to farm them or farm souls to buy them. In Bloodborne, this was not an issue since enemies dropped blood vials often, and the little farming you had to do early game was tolerable. In Demon Souls, I didn't have the will to farm for an hour just to get another try at the boss and be one-shot again. I plan on resuming my playthrough at some point, perhaps using a glitch to get infinite healing items so that I can enjoy the game.",
	"10309": "One of the best games, maybe even as good as Bloodborne in some aspects. The blend of open world and legacy dungeons is amazing, the combat is great, and the boss/enemy variety and music is unparalleled. The only real complaint would be that the endgame areas before Leyndell like the snowy mountain area are lackluster in comparsion to all of the others. The catacombs didn't feel varied enough either. I plan on replaying shortly before the DLC comes out.",
	"10400": "This was my second Souls game, almost a year after playing Bloodborne and shortly before getting Elden Ring. Depsite the generally negative perception, I enjoyed my time with it for the most part. Some of the boss run backs were absolutely awful, and the slower pace was an adjustment having only ever played Bloodborne prior. Late in the mid-game, I was overleveled to the point where most enemies and bosses didn't pose a threat. Similar to how Bloodborne went, this actually made me enjoy the game more. Perhaps I'd feel different if I played to vanilla version way back when, but this was a great time. Didn't bother with the DLC or getting the platinum, since I had jsut ordered a copy of Elden Ring and wanted to get to that.",
	"10402": "This is one of the best looking third party games on Switch. I'm not into racing games much, but it was fun enough to keep playing for a bit. The 60 FPS was great as well.",
	"10703": "I gave this a chance. I really did. Having heard this was one of the best action games, and the best DMC title, I wanted to give it a shot. Upon starting, the resolution was barely 720p (on the PS5 version!) and the framerate was barely 30. Performance aside, I could not get with the controls at all. There are too many button combinations to remember. I don't need \"press X to win\" simplicity, but this was too far in the other direction. For some people this is probably fun, but I can't get into it.",
	"10802": "Other than Paper Mario, I can never get into turn-based comabt. This game was no exception. After having enjoyed the remake, I decided to try the original since it was on PS Plus. It was decent overall, despite not liking the \"combat.\" I did turn on the 3x speed, infinite health and infinite limits cheats because I wanted to just explore the world and experience everything in the game that wasn't a poor excuse for combat. Music was great, although I found some of the cooresponding tracks in the remake to be better. Story was good and the characters were well written. Look forward to playing the next remake and seeing how it compares.",
	"10803": "I gave up after getting stuck on one of the later Seymour fights (maybe the third one?). The only way to progress would be to grind the low level enemies just before the fight for days on end, which is not an option for me. Up until that point, I did somewhat enjoy the game, depsite it being turn-based combat. I also briefly tried X-2, but stopped playing after half an hour because I was so burnt from getting stuck in X that I wanted to move on to a different game.",
	"20001": "I played this after playing Elden Ring, DS2 and Bloodborne. Specifically in comparsion to Dark Souls II, I like this one better for a few reasons. The combat is a bit faster, the level design flows better, and the bosses are more memorable (as well as their themes). The only real complaint I have is that you don't unlock fast travel for awhile, especially when you don't know how to get it. This is somewhat offset by the inter-connected world and abundance of shortcuts, but it still felt bad. My playthrough was tainted since I used the first Firekeeper Soul as an item without realizing what it did and how it was supposed to be used. Instead of starting over, I used the duplication glitch on some soul items to level up enough to make up for the loss in health. Despite this, I was still overleveled by the endgame. Gwyn was still tough, and definitely a good fight to finish off the game."
}